Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/Microchip.PIC32CM-LS_DFP.pdsc
         <device Dname="PIC32CM2532LS60064">
            <processor Dcore="Cortex-M23" Dendian="Little-endian" Dmpu="MPU" Dfpu="NO_FPU" Dtz="TZ"/>
            <compile header="PIC32CM-LS60/include/pic32c.h" define="__PIC32CM2532LS60064__"/>
            <debug svd="PIC32CM-LS60/svd/PIC32CM2532LS60064.svd"/>
            <memory id="IROM1" start="0x00000000" size="0x40000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00400000" size="0x4000"/>
            <memory id="IRAM1" start="0x20000000" size="0x8000" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="PIC32CM-LS60/atdf/PIC32CM2532LS60064.atdf"/>
                  <at:variant ordercode="PIC32CM2532LS60064-I/PT" vccmin="2.0" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="PIC32CM2532LS60064-I/5LX" vccmin="2.0" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:memory name="FLASH" start="0x00000000" size="0x40000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="AUX0" start="0x00804000" size="0x100" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="AUX1" start="0x00806000" size="0x100" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="AUX2" start="0x00808000" size="0x100" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="AUX3" start="0x0080A000" size="0x100" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="AUX4" start="0x0080C000" size="0x100" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="AUX5" start="0x0080E000" size="0x100" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="BOCOR" start="0x0080C000" size="0x100" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="BOCOR1" start="0x0080C008" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="CAL" start="0x00800000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="DATAFLASH" start="0x00400000" size="0x4000" type="flash" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="LOCKROW" start="0x00802000" size="0x4" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP1" start="0x00806000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP2" start="0x00806008" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP3" start="0x00806010" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP4" start="0x00806018" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="ROM" start="0x00830000" size="0x10000" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="SHADOW" start="0x00820000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="SW_CALIB" start="0x00806020" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="TLATCH" start="0x00810000" size="0x10000" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="HSRAM" start="0x20000000" size="0x8000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="APBA" start="0x40000000" size="0x8000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="APBB" start="0x41000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="APBC" start="0x42000000" size="0x6000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW" address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="PIC32CM-LS60/edc/PIC32CM2532LS60064.PIC"/>
                  <mchp:xc32 name="PIC32CM-LS60/xc32"/>
                  <mchp:hwtool type="mplab.nmmrs">
                     <mchp:file name="PIC32CM-LS60/hwtools/mplab/avr.8bit.NMMRs.xml"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/mplab/8bit.NMMRs.xml"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/mplab/32bit.NMMRs.xml"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/mplab/arm.32bit.NMMRs.xml"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/mplab/16bit.NMMRs.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.devicesupport">
                     <mchp:file name="PIC32CM-LS60/hwtools/mplab/mplab.deviceSupport"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="PIC32CM-LS60/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="PIC32CM-LS60/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="emu">
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/PK3OBDbgToolManager.emu"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/Simulator.emu"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/ICD4ToolBase.emu"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/Snap2ToolImpl.emu"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/SnapToolImpl.emu"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/RI4HybridToolImpl.emu"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/ICD3DbgToolManager.emu"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/SKDEManager.emu"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/PICkit3DbgToolManager.emu"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/PKOB4ToolImpl.emu"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/PICkit2DbgToolManager.emu"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/AtmelIceBase.emu"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/RIDbgToolManager.emu"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/Pk4HybridTooImpl.emu"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/PKOBSKDEDbgToolManager.emu"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/emu/AtmelIceScriptingBase.emu"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="tex">
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/PK4ToolBase.toolMediator"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/PKOBSKDEDbgToolManager.toolMediator"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/RI4HybridToolImpl.toolMediator"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/ICD4ToolBase.toolMediator"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/RIDbgToolManager.toolMediator"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/PK3OBDbgToolManager.toolMediator"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/SKDEManager.toolMediator"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/PICkit2DbgToolManager.toolMediator"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/PICkit3DbgToolManager.toolMediator"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/Snap2ToolImpl.toolMediator"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/SnapToolImpl.toolMediator"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/Pk4HybridTooImpl.toolMediator"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/PgmToolManager.toolMediator"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/AtmelIceScriptingBase.toolMediator"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/ICD3DbgToolManager.toolMediator"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/tex/PKOB4ToolImpl.toolMediator"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="PIC32CM-LS60/hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="pkg">
                     <mchp:file name="PIC32CM-LS60/hwtools/pkg/pkg.pkg"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="pk4">
                     <mchp:file name="PIC32CM-LS60/hwtools/pk4/pk4.pk4"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr.arm32">
                     <mchp:file name="PIC32CM-LS60/hwtools/persfr/arm32.persfr"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="per">
                     <mchp:file name="PIC32CM-LS60/hwtools/per/pic18.per"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/per/pic32.per"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/per/dspic.per"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/per/pic16.per"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/per/armcm7.per"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/per/avr8.per"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/per/pic12.per"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/per/usart.ispPeripheral.xml"/>
                     <mchp:file name="PIC32CM-LS60/hwtools/per/usart.plibgen.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="icd4">
                     <mchp:file name="PIC32CM-LS60/hwtools/icd4/icd4.icd4"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="ice4">
                     <mchp:file name="PIC32CM-LS60/hwtools/ice4/ice4.ice4"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32CM2532LS60064" title="Device page for PIC32CM2532LS60064"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32CM2532LS60064" title="Datasheet"/>
         </device>
      </family>
   </devices>
   <conditions>
      <condition id="ARMCC Exe">
         <accept Tcompiler="ARMCC" Toutput="exe"/>
      </condition>
      <condition id="GCC">
         <accept Tcompiler="GCC"/>
      </condition>
      <condition id="GCC Exe">
         <accept Tcompiler="GCC" Toutput="exe"/>
      </condition>
      <condition id="IAR Exe">
         <accept Tcompiler="IAR" Toutput="exe"/>
      </condition>
      <condition id="XC">
         <accept Tcompiler="XC"/>
      </condition>
      <condition id="C">
         <accept Tcompiler="ARMCC"/>
         <accept Tcompiler="GCC"/>
         <accept Tcompiler="IAR"/>
      </condition>
      <condition id="C Exe">
         <accept Tcompiler="ARMCC" Toutput="exe"/>
         <accept Tcompiler="GCC" Toutput="exe"/>
         <accept Tcompiler="IAR" Toutput="exe"/>
      </condition>
      <condition id="C Lib">
         <accept Tcompiler="ARMCC" Toutput="lib"/>
         <accept Tcompiler="GCC" Toutput="lib"/>
         <accept Tcompiler="IAR" Toutput="lib"/>
      </condition>
      <condition id="PIC32CM1216LS60100">
         <require Dvendor="Microchip:3" Dname="PIC32CM1216LS60100"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
