Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/Microchip.PIC32CM-LS_DFP.pdsc
      <condition id="PIC32CM1216LS60048">
         <require Dvendor="Microchip:3" Dname="PIC32CM1216LS60048"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM5164LS00048">
         <require Dvendor="Microchip:3" Dname="PIC32CM5164LS00048"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM1216LS00100">
         <require Dvendor="Microchip:3" Dname="PIC32CM1216LS00100"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM2532LS60048">
         <require Dvendor="Microchip:3" Dname="PIC32CM2532LS60048"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM5164LS60064">
         <require Dvendor="Microchip:3" Dname="PIC32CM5164LS60064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM5164LS00100">
         <require Dvendor="Microchip:3" Dname="PIC32CM5164LS00100"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM5164LS60100">
         <require Dvendor="Microchip:3" Dname="PIC32CM5164LS60100"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM1216LS60064">
         <require Dvendor="Microchip:3" Dname="PIC32CM1216LS60064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM2532LS60100">
         <require Dvendor="Microchip:3" Dname="PIC32CM2532LS60100"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM1216LS00064">
         <require Dvendor="Microchip:3" Dname="PIC32CM1216LS00064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM5164LS00064">
         <require Dvendor="Microchip:3" Dname="PIC32CM5164LS00064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM2532LS00048">
         <require Dvendor="Microchip:3" Dname="PIC32CM2532LS00048"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM5164LS60048">
         <require Dvendor="Microchip:3" Dname="PIC32CM5164LS60048"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM2532LS00064">
         <require Dvendor="Microchip:3" Dname="PIC32CM2532LS00064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM1216LS00048">
         <require Dvendor="Microchip:3" Dname="PIC32CM1216LS00048"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM2532LS00100">
         <require Dvendor="Microchip:3" Dname="PIC32CM2532LS00100"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM2532LS60064">
         <require Dvendor="Microchip:3" Dname="PIC32CM2532LS60064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CM1216LS60100">
         <description>Headers and startup code for Microchip PIC32CM1216LS60100</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-LS60/include/"/>
            <file condition="C" category="header" name="PIC32CM-LS60/include/pic32c.h"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS60/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS60/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS60/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS60/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS60/gcc/gcc/startup_pic32cm1216ls60100.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS60/gcc/system_pic32cm1216ls60100.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="PIC32CM-LS60/gcc/gcc/pic32cm1216ls60100_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="PIC32CM-LS60/gcc/gcc/pic32cm1216ls60100_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS60/armcc/armcc/startup_pic32cm1216ls60100.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS60/armcc/system_pic32cm1216ls60100.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS60/iar/iar/startup_pic32cm1216ls60100.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS60/iar/system_pic32cm1216ls60100.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="PIC32CM-LS60/iar/config/linker/Microchip/pic32cm1216ls60100/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="PIC32CM-LS60/iar/config/linker/Microchip/pic32cm1216ls60100/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CM1216LS60048">
         <description>Headers and startup code for Microchip PIC32CM1216LS60048</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-LS60/include/"/>
            <file condition="C" category="header" name="PIC32CM-LS60/include/pic32c.h"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS60/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS60/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS60/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS60/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS60/gcc/gcc/startup_pic32cm1216ls60048.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS60/gcc/system_pic32cm1216ls60048.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="PIC32CM-LS60/gcc/gcc/pic32cm1216ls60048_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="PIC32CM-LS60/gcc/gcc/pic32cm1216ls60048_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS60/armcc/armcc/startup_pic32cm1216ls60048.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS60/armcc/system_pic32cm1216ls60048.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS60/iar/iar/startup_pic32cm1216ls60048.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS60/iar/system_pic32cm1216ls60048.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="PIC32CM-LS60/iar/config/linker/Microchip/pic32cm1216ls60048/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="PIC32CM-LS60/iar/config/linker/Microchip/pic32cm1216ls60048/flash.icf" attr="config"/>
         </files>
      </component>
