Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/Microchip.PIC32CM-LS_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CM5164LS00048">
         <description>Headers and startup code for Microchip PIC32CM5164LS00048</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-LS00/include/"/>
            <file condition="C" category="header" name="PIC32CM-LS00/include/pic32c.h"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS00/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS00/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS00/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS00/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS00/gcc/gcc/startup_pic32cm5164ls00048.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS00/gcc/system_pic32cm5164ls00048.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="PIC32CM-LS00/gcc/gcc/pic32cm5164ls00048_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="PIC32CM-LS00/gcc/gcc/pic32cm5164ls00048_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS00/armcc/armcc/startup_pic32cm5164ls00048.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS00/armcc/system_pic32cm5164ls00048.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS00/iar/iar/startup_pic32cm5164ls00048.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS00/iar/system_pic32cm5164ls00048.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="PIC32CM-LS00/iar/config/linker/Microchip/pic32cm5164ls00048/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="PIC32CM-LS00/iar/config/linker/Microchip/pic32cm5164ls00048/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CM1216LS00100">
         <description>Headers and startup code for Microchip PIC32CM1216LS00100</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-LS00/include/"/>
            <file condition="C" category="header" name="PIC32CM-LS00/include/pic32c.h"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS00/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS00/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS00/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS00/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS00/gcc/gcc/startup_pic32cm1216ls00100.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS00/gcc/system_pic32cm1216ls00100.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="PIC32CM-LS00/gcc/gcc/pic32cm1216ls00100_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="PIC32CM-LS00/gcc/gcc/pic32cm1216ls00100_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS00/armcc/armcc/startup_pic32cm1216ls00100.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS00/armcc/system_pic32cm1216ls00100.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS00/iar/iar/startup_pic32cm1216ls00100.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS00/iar/system_pic32cm1216ls00100.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="PIC32CM-LS00/iar/config/linker/Microchip/pic32cm1216ls00100/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="PIC32CM-LS00/iar/config/linker/Microchip/pic32cm1216ls00100/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CM2532LS60048">
         <description>Headers and startup code for Microchip PIC32CM2532LS60048</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-LS60/include/"/>
            <file condition="C" category="header" name="PIC32CM-LS60/include/pic32c.h"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS60/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS60/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS60/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS60/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS60/gcc/gcc/startup_pic32cm2532ls60048.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS60/gcc/system_pic32cm2532ls60048.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="PIC32CM-LS60/gcc/gcc/pic32cm2532ls60048_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="PIC32CM-LS60/gcc/gcc/pic32cm2532ls60048_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS60/armcc/armcc/startup_pic32cm2532ls60048.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS60/armcc/system_pic32cm2532ls60048.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS60/iar/iar/startup_pic32cm2532ls60048.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS60/iar/system_pic32cm2532ls60048.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="PIC32CM-LS60/iar/config/linker/Microchip/pic32cm2532ls60048/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="PIC32CM-LS60/iar/config/linker/Microchip/pic32cm2532ls60048/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CM5164LS60064">
         <description>Headers and startup code for Microchip PIC32CM5164LS60064</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-LS60/include/"/>
            <file condition="C" category="header" name="PIC32CM-LS60/include/pic32c.h"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS60/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS60/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS60/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS60/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS60/gcc/gcc/startup_pic32cm5164ls60064.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS60/gcc/system_pic32cm5164ls60064.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="PIC32CM-LS60/gcc/gcc/pic32cm5164ls60064_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="PIC32CM-LS60/gcc/gcc/pic32cm5164ls60064_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS60/armcc/armcc/startup_pic32cm5164ls60064.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS60/armcc/system_pic32cm5164ls60064.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS60/iar/iar/startup_pic32cm5164ls60064.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS60/iar/system_pic32cm5164ls60064.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="PIC32CM-LS60/iar/config/linker/Microchip/pic32cm5164ls60064/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="PIC32CM-LS60/iar/config/linker/Microchip/pic32cm5164ls60064/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CM5164LS00100">
         <description>Headers and startup code for Microchip PIC32CM5164LS00100</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-LS00/include/"/>
            <file condition="C" category="header" name="PIC32CM-LS00/include/pic32c.h"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS00/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS00/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS00/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS00/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS00/gcc/gcc/startup_pic32cm5164ls00100.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS00/gcc/system_pic32cm5164ls00100.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="PIC32CM-LS00/gcc/gcc/pic32cm5164ls00100_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="PIC32CM-LS00/gcc/gcc/pic32cm5164ls00100_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS00/armcc/armcc/startup_pic32cm5164ls00100.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS00/armcc/system_pic32cm5164ls00100.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS00/iar/iar/startup_pic32cm5164ls00100.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS00/iar/system_pic32cm5164ls00100.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="PIC32CM-LS00/iar/config/linker/Microchip/pic32cm5164ls00100/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="PIC32CM-LS00/iar/config/linker/Microchip/pic32cm5164ls00100/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CM5164LS60100">
         <description>Headers and startup code for Microchip PIC32CM5164LS60100</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-LS60/include/"/>
            <file condition="C" category="header" name="PIC32CM-LS60/include/pic32c.h"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS60/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS60/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS60/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS60/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS60/gcc/gcc/startup_pic32cm5164ls60100.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS60/gcc/system_pic32cm5164ls60100.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="PIC32CM-LS60/gcc/gcc/pic32cm5164ls60100_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="PIC32CM-LS60/gcc/gcc/pic32cm5164ls60100_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS60/armcc/armcc/startup_pic32cm5164ls60100.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS60/armcc/system_pic32cm5164ls60100.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS60/iar/iar/startup_pic32cm5164ls60100.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS60/iar/system_pic32cm5164ls60100.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="PIC32CM-LS60/iar/config/linker/Microchip/pic32cm5164ls60100/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="PIC32CM-LS60/iar/config/linker/Microchip/pic32cm5164ls60100/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CM1216LS60064">
         <description>Headers and startup code for Microchip PIC32CM1216LS60064</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-LS60/include/"/>
            <file condition="C" category="header" name="PIC32CM-LS60/include/pic32c.h"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS60/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS60/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS60/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS60/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS60/gcc/gcc/startup_pic32cm1216ls60064.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS60/gcc/system_pic32cm1216ls60064.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="PIC32CM-LS60/gcc/gcc/pic32cm1216ls60064_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="PIC32CM-LS60/gcc/gcc/pic32cm1216ls60064_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS60/armcc/armcc/startup_pic32cm1216ls60064.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS60/armcc/system_pic32cm1216ls60064.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS60/iar/iar/startup_pic32cm1216ls60064.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS60/iar/system_pic32cm1216ls60064.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="PIC32CM-LS60/iar/config/linker/Microchip/pic32cm1216ls60064/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="PIC32CM-LS60/iar/config/linker/Microchip/pic32cm1216ls60064/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CM2532LS60100">
         <description>Headers and startup code for Microchip PIC32CM2532LS60100</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-LS60/include/"/>
            <file condition="C" category="header" name="PIC32CM-LS60/include/pic32c.h"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS60/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS60/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS60/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS60/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS60/gcc/gcc/startup_pic32cm2532ls60100.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS60/gcc/system_pic32cm2532ls60100.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="PIC32CM-LS60/gcc/gcc/pic32cm2532ls60100_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="PIC32CM-LS60/gcc/gcc/pic32cm2532ls60100_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS60/armcc/armcc/startup_pic32cm2532ls60100.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS60/armcc/system_pic32cm2532ls60100.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS60/iar/iar/startup_pic32cm2532ls60100.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS60/iar/system_pic32cm2532ls60100.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="PIC32CM-LS60/iar/config/linker/Microchip/pic32cm2532ls60100/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="PIC32CM-LS60/iar/config/linker/Microchip/pic32cm2532ls60100/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CM1216LS00064">
         <description>Headers and startup code for Microchip PIC32CM1216LS00064</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-LS00/include/"/>
            <file condition="C" category="header" name="PIC32CM-LS00/include/pic32c.h"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS00/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS00/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS00/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS00/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS00/gcc/gcc/startup_pic32cm1216ls00064.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS00/gcc/system_pic32cm1216ls00064.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="PIC32CM-LS00/gcc/gcc/pic32cm1216ls00064_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="PIC32CM-LS00/gcc/gcc/pic32cm1216ls00064_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS00/armcc/armcc/startup_pic32cm1216ls00064.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS00/armcc/system_pic32cm1216ls00064.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS00/iar/iar/startup_pic32cm1216ls00064.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS00/iar/system_pic32cm1216ls00064.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="PIC32CM-LS00/iar/config/linker/Microchip/pic32cm1216ls00064/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="PIC32CM-LS00/iar/config/linker/Microchip/pic32cm1216ls00064/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PIC32CM5164LS00064">
         <description>Headers and startup code for Microchip PIC32CM5164LS00064</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-LS00/include/"/>
            <file condition="C" category="header" name="PIC32CM-LS00/include/pic32c.h"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS00/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="PIC32CM-LS00/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS00/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="PIC32CM-LS00/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS00/gcc/gcc/startup_pic32cm5164ls00064.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="PIC32CM-LS00/gcc/system_pic32cm5164ls00064.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="PIC32CM-LS00/gcc/gcc/pic32cm5164ls00064_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="PIC32CM-LS00/gcc/gcc/pic32cm5164ls00064_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS00/armcc/armcc/startup_pic32cm5164ls00064.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="PIC32CM-LS00/armcc/system_pic32cm5164ls00064.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS00/iar/iar/startup_pic32cm5164ls00064.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="PIC32CM-LS00/iar/system_pic32cm5164ls00064.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="PIC32CM-LS00/iar/config/linker/Microchip/pic32cm5164ls00064/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="PIC32CM-LS00/iar/config/linker/Microchip/pic32cm5164ls00064/flash.icf" attr="config"/>
         </files>
      </component>
